app/controllers/songs_controller.rb

  def new
    #if there is an artists id and the artiest does not exist
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"